import 'package:get/get.dart';
import 'package:qatarcustomsgac/Futcher/pageScreen/model/pageModel.dart';

class PagelistController extends GetxController {
  List<PageObject> pagelist =[
    PageObject(
      id:1,
      name: ' جمرك ميناء الرويس',
      descriprion: 'يعتبر من الموانئ الشمالية، ويختص الجمرك بمراقبة حركة البضائع الواردة والصادرة وحركة المسافرين ووسائط النقل بالمنفذ',
      img: ['assets/images/ميناء الرويس 1.JPG','assets/images/ميناء الرويس 2.JPG'],
    ),
    PageObject(id: 2,
        name: ' جمرك ميناء رأس لفان',
        descriprion: "يعتبر من الموانئ الشمالية للدولة ، ويختص الجمرك بمراقبة حركة البضائع الواردة والصادرة وحركة المسافرين ووسائط النقل بالمنفذ",
        img: []),
    PageObject(id: 3, name: 'منطقه جمرك ميناء الدوحة القديم', descriprion: "ويعتبر من الموانئ الشمالية للدولة ، ويختص الجمرك بمراقبة حركة المسافرين القادمين والمغادرين والترانزيت ووسائط النقل بالمنفذ ، وتفتيش ومعاينة امتعتهم",
        img: []),
    PageObject(id: 4,
        name: 'جمرك واحة العلوم (منطقة حرة)',
        descriprion: 'منطقة حرة تابعة للشحن الجوي ، ويختص الجمرك فيها بالإشراف على إيداع وإخراج البضائع التابعة لمؤسسة قطر للتربية والعلوم وتنمية المجتمع',
        img: []),
    PageObject(id: 5, name: 'جمرك مطار حمد الدولي',
      descriprion: "يختص الجمرك بمراقبة حركة المسافرين عن طريق صالة الركاب الرئيسية في مبني المطار والترانزيت والصالات الخارجية مثل الصالة الوزارية وصالة كبار المسافرين، وتفتيش ومعاينة أمتعتهم، ومراقبة انتقال العملات والأدوات المالية القابلة للتداول لحاملها والمعادن النفيسة والاحجار الكريمة والمنقولة برفقة المسافرين في هذا المنفذ",
      img: ['assets/images/ميناء حمد 1.JPG','assets/images/ميناء حمد 2.JPG','assets/images/ميناء حمد 3.JPG'],
    ),
    PageObject(id: 6, name: 'جمرك الشحن الجوي', descriprion: 'يختص الجمرك بمراقبة حركة البضائع الواردة والصادرة والترانزيت عن طريق جمرك الشحن الجوي وتفتيش ومعاينة وسائل النقل والبضائع والأشخاص فيها',
      img: ['assets/images/الشحن الجوي 1.JPG','assets/images/الشحن الجوي 2.JPG','assets/images/الشحن الجوي 3.JPG'],),
    PageObject(id: 7, name: 'جمرك ميناء حمد',
        descriprion: 'ويعتبر من الموانئ الجنوبية للدولة، ويختص الجمرك بمراقبة حركة البضائع الواردة والصادرة وحركة المسافرين ووسائط النقل بالمنفذ ',
        img: []),
    PageObject(id: 8, name: 'جمرك ميناء مسيعيد', descriprion: 'يعتبر من الموانئ الجنوبية للدولة ، ويختص الجمرك بمراقبة حركة البضائع الواردة والصادرة وحركة المسافرين ووسائط النقل بالمنفذ',
        img:[] ),
    PageObject(id: 9, name: 'جمرك ام الحول (منطقة حرة)', descriprion: 'منطقة حرة تابعة للجمارك البحرية ، ويختص الجمرك فيها بالإشراف على إيداع وإخراج البضائع في المنطقة الحرة والمستودعات والأسواق الحرة',
        img:[] ),
    PageObject(id: 10, name: 'جمرك قاعدة العديد الجوية', descriprion: 'يختص الجمرك بمراقبة حركة البضائع الواردة والصادرة وحركة المسافرين في ووسائط النقل في قاعدة العديد الجوية ، وذلك وفقا لأحكام القوانين والقرارات المنظمة في هذا الشأن',
        img:[] ),
    PageObject(id: 11, name: 'جمرك البريد العام', descriprion: 'يختص الجمرك بمراقبة حركة الرسائل والطرود البريدية الواردة والصادرة عن طريق المنافذ الجوية وشركات النقل الجوي السريع والقيام بتفتيشها ومعاينتها، إضافة الى تفتيش ومعاينة وسائط النقل',
        img: []),
    PageObject(id: 12, name: 'جمرك راس أبو فنطاس (منطقة حرة)', descriprion: 'منطقة حرة تابعة للشحن الجوي ، ويختص الجمرك فيها بالإشراف على إيداع وإخراج البضائع في المنطقة الحرة والمستودعات والأسواق الحرة',
        img:[] ),
    PageObject(id: 13, name: 'جمرك مطار الدوحة', descriprion: 'يعمل الجمرك في الأوقات والحالات الاستثنائية التي يفتح فيها المطار، ويختص الجمرك بمراقبة حركة المسافرين عن طريق صالة الركاب الرئيسية في مبني المطار وتفتيش ومعاينة أمتعتهم، ومراقبة انتقال العملات والأدوات المالية القابلة للتداول لحاملها والمعادن النفيسة والاحجار الكريمة والمنقولة برفقة المسافرين في هذا المنفذ',
        img: ['assets/images/ميناء الدوحة 1.JPG']),
    PageObject(id: 14, name: 'الجمرك البري (ابوسمرة الحدودي)', descriprion: 'يختص بمراقبة حركة المسافرين عن طريق منفذ أبو سمرة وتفتيش ومعاينة امتعتهم ومراقبة حركة البضائع الواردة والصادرة برفقة الركاب ومراقبة انتقال العملات والأدوات المالية القابلة للتدوير لحاملها والمعادن النفيسة والاحجار الكريمة والمنقولة برفقتهم ، كما يختص بمراقبة حركة البضائع الواردة والصادرة  التي تنقل برا عن طريق دائرة الشحن البري ',
        img:[
          'assets/images/ابو سمرة 1.JPG',
          'assets/images/ابو سمرة 2.JPG'
        ]),
    PageObject(id: 15, name: 'جمرك النقل البري', descriprion: 'نقطة جمركية موجودة على طريق سلوى وكانت تختص قبل عدة عقود في التدقيق الشاحنات القادمة من المنفذ البري، أما الان فهي تحتوي على عدد من لجان العمل المكملة للعمل الإداري الخاص بالمنافذ الجمركية',
        img: []),
    PageObject(id: 16, name: 'المبنى الرئيسي للهيئة', descriprion: 'المقر الإداري الرئيسي للهيئة ويتضمن مكاتب الإدارات المساندة ومكاتب الإدارة العليا للهيئة',
        img: ['assets/images/المبنى الرئيسي للهيئة 1.jpg',
          'assets/images/المبنى الرئيسي للهيئة 2.JPG'])
  ];

  PageObject GetPageOpject(id){
    PageObject result = pagelist.firstWhere((element)=>element.id==id);
    return result;
  }
  @override
  void onInit() {
    // TODO: implement onInit
    // GetPageOpject();
    super.onInit();
  }
}